Repository: wendrillaksenow/deltaTalkTTS
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_br, pt_pt

source: This add-on requires copying DeltaTalk files to the NVDA program directory ({path}). {uac_message} If the files are not copied, the DeltaTalk synthesizer may not work. Do you want to proceed with the installation?
pt_br: Este complemento requer a cópia dos arquivos do DeltaTalk para o diretório do programa NVDA ({path}). {uac_message} Se os arquivos não forem copiados, o sintetizador DeltaTalk pode não funcionar. Deseja prosseguir com a instalação?
pt_pt: Este extra requer a cópia dos ficheiros do DeltaTalk para o diretório do programa NVDA ({path}). {uac_message} Se os ficheiros não forem copiados, o sintetizador DeltaTalk pode não funcionar. Pretende prosseguir com a instalação?

source: Administrator permission (UAC) will be required.
pt_br: Será necessária a permissão do administrador (UAC).
pt_pt: Será necessária a permissão do administrador (UAC).

source: Installation Confirmation
pt_br: Confirmação de instalação
pt_pt: Confirmação de instalação

source: This version includes an updated DeltaTalk pronunciation dictionary ({dict}). The updated dictionary needs to be copied to the NVDA program directory ({path}). {uac_message} Do you want to copy the updated dictionary now? If not, the synthesizer will work, but pronunciation corrections will not be applied.
pt_br: Esta versão inclui um dicionário de pronúncia atualizado para o DeltaTalk ({dict}). O dicionário atualizado precisa ser copiado para o diretório do programa NVDA ({path}). {uac_message} Deseja copiar o dicionário atualizado agora? Caso contrário, o sintetizador funcionará, mas as correções de pronúncia não serão aplicadas.
pt_pt: Esta versão inclui um dicionário de pronúncia do DeltaTalk atualizado ({dict}). O dicionário atualizado tem de ser copiado para o diretório do programa NVDA ({path}). {uac_message} Pretende copiar o dicionário atualizado agora? Caso contrário, o sintetizador funcionará, mas as correções de pronúncia não serão aplicadas.

source: Dictionary Update Confirmation
pt_br: Confirmação de atualização do dicionário
pt_pt: Confirmação de Atualização do Dicionário

source: This add-on needs to copy/update DeltaTalk files to the NVDA program directory ({path}). {uac_message} Do you want to proceed?
pt_br: Este complemento precisa copiar/atualizar os arquivos do DeltaTalk para o diretório do programa NVDA ({path}). {uac_message} Deseja continuar?
pt_pt: Este extra necessita de copiar/atualizar os ficheiros do DeltaTalk para o diretório do programa NVDA ({path}). {uac_message} Deseja continuar?

source: Installation canceled by user during file copy confirmation
pt_br: Instalação cancelada pelo usuário durante a confirmação de cópia de arquivos
pt_pt: Instalação cancelada pelo utilizador durante a confirmação da cópia de ficheiros

source: The copy of the files has been canceled. The synthesizer will try to copy the files before it is loaded for the first time. If this fails, the synthesizer may not work correctly. To avoid issues, you can reinstall the add-on and allow the file copy or manually copy the files from the add-on directory (synthDrivers/deltatalk) to the NVDA program folder ({path}).
pt_br: A cópia dos arquivos foi cancelada. O sintetizador tentará copiar os arquivos antes de ser carregado pela primeira vez. Se isso falhar, o sintetizador pode não funcionar corretamente. Para evitar problemas, você pode reinstalar o complemento e permitir a cópia dos arquivos ou copiar manualmente os arquivos do diretório do complemento (synthDrivers/deltatalk) para a pasta do programa NVDA ({path}).
pt_pt: A cópia dos ficheiros foi cancelada. O sintetizador tentará copiar os ficheiros antes de ser carregado pela primeira vez. Se isto falhar, o sintetizador pode não funcionar corretamente. Para evitar problemas, pode reinstalar o extra e permitir a cópia de ficheiros ou copiar manualmente os ficheiros do diretório do extra (synthDrivers/deltatalk) para a pasta do programa NVDA ({path}).

source: File Copy Canceled
pt_br: Cópia de Arquivos Cancelada
pt_pt: Cópia de Ficheiros Cancelada

source: Attempting to copy files with elevated permissions
pt_br: Tentando copiar arquivos com permissões elevadas
pt_pt: Tentativa de copiar ficheiros com permissões elevadas

source: Copying files with normal permissions
pt_br: Copiando arquivos com permissões normais
pt_pt: A copiar ficheiros com permissões normais

source: DeltaTalk files successfully copied/updated to {path}
pt_br: Arquivos do DeltaTalk copiados/atualizados com sucesso para {path}
pt_pt: Os ficheiros do DeltaTalk foram copiados/atualizados com sucesso para {path}

source: DeltaTalk files successfully copied to: {path} The DeltaTalk synthesizer is now ready to use. You can now select MicroPower DeltaTalk TTS as your synthesizer in NVDA settings. Note: These files will be automatically removed if you uninstall this add-on.
pt_br: Os arquivos do DeltaTalk foram copiados com sucesso para: {path} O sintetizador DeltaTalk agora está pronto para uso. Você pode agora selecionar o MicroPower DeltaTalk TTS como seu sintetizador nas configurações do NVDA. Observação: Esses arquivos serão removidos automaticamente se você desinstalar este complemento.
pt_pt: Os ficheiros do DeltaTalk foram copiados com sucesso para: {path} O sintetizador DeltaTalk está agora pronto a ser utilizado. Pode agora selecionar o MicroPower DeltaTalk TTS como o seu sintetizador nas configurações do NVDA. Nota: Estes ficheiros serão automaticamente removidos se o extra for desinstalado.

source: Installation Completed
pt_br: Instalação concluída
pt_pt: Instalação concluída

source: The DeltaTalk pronunciation dictionary ({dict}) was successfully updated in: {path} The synthesizer is now ready to use with the latest pronunciation corrections.
pt_br: O dicionário de pronúncia do DeltaTalk ({dict}) foi atualizado com sucesso em: {path} O sintetizador agora está pronto para ser usado com as últimas correções de pronúncia.
pt_pt: O dicionário de pronúncia do DeltaTalk ({dict}) foi atualizado com sucesso em: {path} O sintetizador está agora pronto a ser utilizado com as últimas correções de pronúncia.

source: Dictionary Update Completed
pt_br: Atualização do Dicionário Concluída
pt_pt: Atualização do Dicionário Concluída

source: Failed to copy/update DeltaTalk files.
pt_br: Falha ao copiar/atualizar os arquivos do DeltaTalk.
pt_pt: Falha ao copiar/atualizar os ficheiros do DeltaTalk.

source: Failed to copy or update some DeltaTalk files to: {path} The synthesizer will try to copy these files before it is loaded for the first time. If this fails, you may need to: 1. Run NVDA as administrator and reinstall the add-on, or 2. Manually copy the files from the add-on directory (synthDrivers/deltatalk) to the NVDA program folder. Please check the NVDA log for more details.
pt_br: Falha ao copiar ou atualizar alguns arquivos do DeltaTalk para: {path} O sintetizador tentará copiar esses arquivos antes de ser carregado pela primeira vez. Se isso falhar, você pode precisar: 1. Executar o NVDA como administrador e reinstalar o complemento, ou 2. Copiar manualmente os arquivos do diretório do complemento (synthDrivers/deltatalk) para a pasta do programa NVDA. Por favor, verifique o log do NVDA para mais detalhes.
pt_pt: Falha ao copiar ou atualizar alguns ficheiros do DeltaTalk para: {path} O sintetizador tentará copiar estes ficheiros antes de ser carregado pela primeira vez. Se isto falhar, poderá ser necessário: 1. Executar o NVDA como administrador e reinstalar o extra, ou 2. Copiar manualmente os ficheiros do diretório do extra (synthDrivers/deltatalk) para a pasta do programa NVDA. Por favor, verifique o log do NVDA para obter mais detalhes.

source: Installation Warning
pt_br: Aviso de instalação
pt_pt: Aviso de instalação

source: Error during DeltaTalk add-on installation: {error}
pt_br: Erro durante a instalação do complemento DeltaTalk: {error}
pt_pt: Erro durante a instalação do extra DeltaTalk: {error}

source: Error during installation: {error} Please check the NVDA log for more details.
pt_br: Erro durante a instalação: {error} Por favor, verifique o log do NVDA para obter mais detalhes.
pt_pt: Erro durante a instalação: {error} Por favor, verifique o log do NVDA para obter mais detalhes.

source: Executing removal batch file with elevation: {path}
pt_br: Executando o arquivo em lote de remoção com elevação: {path}
pt_pt: Execução do ficheiro batch de remoção com elevação: {path}

source: Removal batch file executed
pt_br: Arquivo em lote de remoção executado
pt_pt: Ficheiro batch de remoção executado

source: Failed to execute elevated removal batch: {error}
pt_br: Falha ao executar o arquivo em lote de remoção com elevação: {error}
pt_pt: Falha na execução elevada do ficheiro batch de remoção: {error}

source: Failed to schedule batch file cleanup: {error}
pt_br: Falha ao agendar a limpeza do arquivo em lote: {error}
pt_pt: Falha ao agendar a limpeza do ficheiro batch: {error}

source: Error creating/executing removal batch file: {error}
pt_br: Erro ao criar/executar o arquivo em lote de remoção: {error}
pt_pt: Erro ao criar/executar o ficheiro batch de remoção: {error}

source: Removed file: {file}
pt_br: Arquivo removido: {file}
pt_pt: Ficheiro removido: {file}

source: Successfully removed {count} files with admin privileges
pt_br: {count} arquivos removidos com sucesso com privilégios de administrador
pt_pt: {count} ficheiros foram removidos com sucesso com privilégios de administrador

source: Error during elevated removal operation: {error}
pt_br: Erro durante a operação de remoção elevada: {error}
pt_pt: Erro durante a operação de remoção elevada: {error}

source: Failed to remove file {file}: {error}
pt_br: Falha ao remover o arquivo {file}: {error}
pt_pt: Falha ao remover o ficheiro {file}: {error}

source: Error during normal removal operation: {error}
pt_br: Erro durante a operação de remoção normal: {error}
pt_pt: Erro durante a operação normal de remoção: {error}

source: DeltaTalk uninstallation started
pt_br: Desinstalação do DeltaTalk iniciada
pt_pt: Desinstalação do DeltaTalk iniciada

source: No DeltaTalk files found to remove from {path}
pt_br: Nenhum arquivo do DeltaTalk encontrado para remover de {path}
pt_pt: Não foram encontrados ficheiros do DeltaTalk para remover de {path}

source: Found {count} DeltaTalk files to remove: {files}
pt_br: Encontrados {count} arquivos do DeltaTalk para remover: {files}
pt_pt: Foram encontrados {count} ficheiros do DeltaTalk a serem removidos: {files}

source: Elevation needed for removal: {status}
pt_br: Elevação necessária para remoção: {status}
pt_pt: Elevação necessária para a remoção: {status}

source: Attempting to remove files with elevated permissions
pt_br: Tentando remover arquivos com permissões elevadas
pt_pt: Tentativa de remover ficheiros com permissões elevadas

source: DeltaTalk files successfully removed with elevation from {path}
pt_br: Arquivos do DeltaTalk removidos com sucesso de {path} com elevação
pt_pt: Ficheiros do DeltaTalk removidos com sucesso com elevação a partir de {path}

source: Failed to remove files with elevation, trying normal method as fallback
pt_br: Falha ao remover arquivos com elevação, tentando o método normal como alternativa
pt_pt: Falha ao remover ficheiros com elevação, a tentar o método normal como alternativa

source: Some files could not be removed without elevation: {files}
pt_br: Alguns arquivos não puderam ser removidos sem elevação: {files}
pt_pt: Alguns ficheiros não puderam ser removidos sem elevação: {files}

source: You may need to manually remove these files from {path}
pt_br: Você pode precisar remover manualmente esses arquivos de {path}
pt_pt: Poderá ser necessário remover manualmente estes ficheiros de {path}

source: Removing files with normal permissions
pt_br: Removendo arquivos com permissões normais
pt_pt: Remoção de ficheiros com permissões normais

source: Failed to remove some files: {files}
pt_br: Falha ao remover alguns arquivos: {files}
pt_pt: Falha ao remover alguns ficheiros: {files}

source: DeltaTalk uninstallation completed. Removed {count} files from {path}
pt_br: Desinstalação do DeltaTalk concluída. Removidos {count} arquivos de {path}
pt_pt: Desinstalação do DeltaTalk concluída. Foram removidos {count} ficheiros de {path}

source: No DeltaTalk files were removed. Check permissions or remove manually from {path}
pt_br: Nenhum arquivo do DeltaTalk foi removido. Verifique as permissões ou remova manualmente de {path}
pt_pt: Não foram removidos quaisquer ficheiros do DeltaTalk. Verifique as permissões ou remova manualmente de {path}

source: Error during DeltaTalk add-on uninstallation: {error}
pt_br: Erro durante a desinstalação do complemento DeltaTalk: {error}
pt_pt: Erro durante a desinstalação do extra DeltaTalk: {error}
