Repository: wendrillaksenow/deltaTalkTTS
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_br, pt_pt

source: Operation completed successfully
pt_br: Operação concluída com sucesso
pt_pt: Operação concluída com êxito

source: The synthesizer is not initialized
pt_br: O sintetizador não foi inicializado
pt_pt: O sintetizador não foi inicializado

source: The synthesizer is busy processing another task
pt_br: O sintetizador está ocupado processando outra tarefa
pt_pt: O sintetizador está ocupado a processar outra tarefa

source: Invalid command issued to the synthesizer
pt_br: Comando inválido enviado ao sintetizador
pt_pt: Comando inválido emitido para o sintetizador

source: Failed to initialize audio processing subsystem
pt_br: Falha ao inicializar o subsistema de processamento de áudio
pt_pt: Falha ao inicializar o subsistema de processamento de áudio

source: Failed to open the required file
pt_br: Falha ao abrir o arquivo necessário
pt_pt: Falha ao abrir o ficheiro necessário

source: Failed to write to the specified file
pt_br: Falha ao gravar no arquivo especificado
pt_pt: Falha ao escrever no ficheiro especificado

source: Failed to initialize the synthesizer engine
pt_br: Falha ao inicializar o motor de síntese
pt_pt: Falha ao inicializar o motor do sintetizador

source: Insufficient memory to process the request
pt_br: Memória insuficiente para processar a solicitação
pt_pt: Memória insuficiente para processar o pedido

source: Audio device is already in use by another program
pt_br: O dispositivo de áudio já está em uso por outro programa
pt_pt: O dispositivo de áudio já está a ser utilizado por outro programa

source: Failed to open the audio device
pt_br: Falha ao abrir o dispositivo de áudio
pt_pt: Falha ao abrir o dispositivo de áudio

source: Failed to send audio buffer to the sound card
pt_br: Falha ao enviar o buffer de áudio para a placa de som
pt_pt: Falha ao enviar a memória intermédia de áudio para a placa de som

source: Audio format not supported by the sound card
pt_br: Formato de áudio não suportado pela placa de som
pt_pt: Formato de áudio não suportado pela placa de som

source: Audio output device is not available
pt_br: O dispositivo de saída de áudio não está disponível
pt_pt: O dispositivo de saída de áudio não está disponível

source: Error communicating with the sound card driver
pt_br: Erro na comunicação com o driver da placa de som
pt_pt: Erro de comunicação com o controlador da placa de som

source: Insufficient memory to store synthesized audio
pt_br: Memória insuficiente para armazenar áudio sintetizado
pt_pt: Memória insuficiente para armazenar áudio sintetizado

source: The provided value is out of range
pt_br: O valor fornecido está fora do intervalo
pt_pt: O valor fornecido está fora do intervalo

source: PCM audio processing completed
pt_br: Processamento de áudio PCM concluído
pt_pt: Processamento de áudio PCM concluído

source: Internal signal processing error
pt_br: Erro de processamento de sinal interno
pt_pt: Erro de processamento do sinal interno

source: DSP file not found
pt_br: Arquivo DSP não encontrado
pt_pt: Ficheiro DSP não encontrado

source: Prosody modeling file not found
pt_br: Arquivo de modelagem de prosódia não encontrado
pt_pt: Ficheiro de modelação de prosódia não encontrado

source: The number of simultaneous instances of the synthesizer has been extrapolated
pt_br: O número de instâncias simultâneas do sintetizador foi extrapolado
pt_pt: O número de instâncias simultâneas do sintetizador foi extrapolado

source: Executing batch file with elevation: {path}
pt_br: Executando o arquivo em lote com elevação: {path}
pt_pt: Execução de ficheiro batch com elevação: {path}

source: Files copied successfully with elevated permissions
pt_br: Arquivos copiados com sucesso com permissões elevadas
pt_pt: Ficheiros copiados com sucesso com permissões elevadas

source: Batch file execution failed with code: {code}
pt_br: A execução do arquivo em lote falhou com o código: {code}
pt_pt: A execução do ficheiro batch falhou com o código: {code}

source: Failed to delete temporary batch file: {error}
pt_br: Falha ao excluir o arquivo em lote temporário: {error}
pt_pt: Falha ao eliminar o ficheiro batch temporário: {error}

source: Error creating/executing batch file: {error}
pt_br: Erro ao criar/executar arquivo em lote: {error}
pt_pt: Erro ao criar/executar ficheiro batch: {error}

source: Checking the path: {path}
pt_br: Verificando o caminho: {path}
pt_pt: A verificar caminho: {path}

source: Dtalk32T.dll not found
pt_br: Dtalk32t.dll não encontrado
pt_pt: Dtalk32T.dll não encontrado

source: Dtalk32T.dll loaded successfully
pt_br: Dtalk32t.dll carregado com sucesso
pt_pt: Dtalk32T.dll carregado com sucesso

source: Failed to load DLL: {error}
pt_br: Falha ao carregar DLL: {error}
pt_pt: Falha ao carregar a DLL: {error}

source: Dictionary file {file} missing in NVDA. Will be copied.
pt_br: Arquivo de dicionário {file} ausente no NVDA. Será copiado.
pt_pt: Ficheiro de dicionário {file} em falta no NVDA. Será copiado.

source: Dictionary file {file} is outdated in NVDA. Will be copied.
pt_br: O arquivo de dicionário {file} está desatualizado no NVDA. Será copiado.
pt_pt: O ficheiro de dicionário {file} está desatualizado no NVDA. Será copiado.

source: Dictionary file {file} is up to date.
pt_br: O arquivo de dicionário {file} está atualizado.
pt_pt: O ficheiro de dicionário {file} está atualizado.

source: Dictionary file {file} not found in add-on. Skipping.
pt_br: Arquivo de dicionário {file} não encontrado no complemento. Ignorado.
pt_pt: Ficheiro de dicionário {file} não encontrado no extra. Saltar.

source: Required file not found in add-on: {file}
pt_br: Arquivo necessário não encontrado no complemento: {file}
pt_pt: Ficheiro necessário não encontrado no extra: {file}

source: File missing in NVDA: {file}.
pt_br: Arquivo ausente no NVDA: {file}.
pt_pt: Ficheiro em falta no NVDA: {file}.

source: Missing or outdated files in NVDA: {files}. Attempting to copy from add-on.
pt_br: Arquivos ausentes ou desatualizados no NVDA: {files}. Tentando copiar do complemento.
pt_pt: Ficheiros em falta ou desatualizados no NVDA: {files}. A tentar copiar a partir do extra.

source: Elevated permissions required. Attempting elevated copy.
pt_br: Permissões elevadas necessárias. Tentando cópia elevada.
pt_pt: São necessárias permissões elevadas. Tentativa de cópia elevada.

source: Elevated copy failed. Synthesizer may use outdated dictionary or some files may be missing.
pt_br: Cópia elevada falhou. O sintetizador pode usar dicionário desatualizado ou alguns arquivos podem ficar ausentes.
pt_pt: A cópia elevada falhou. O sintetizador pode utilizar um dicionário desatualizado ou alguns ficheiros podem estar em falta.

source: Normal permissions sufficient. Copying files.
pt_br: Permissões normais suficientes. Copiando arquivos.
pt_pt: As permissões normais são suficientes. A copiar ficheiros.

source: Copied: {file}
pt_br: Copiado: {file}
pt_pt: Copiado: {file}

source: Error copying files: {error}
pt_br: Erro ao copiar arquivos: {error}
pt_pt: Erro ao copiar ficheiros: {error}

source: DeltaTalk files successfully copied/updated to {path}.
pt_br: Arquivos do DeltaTalk copiados/atualizados com sucesso para {path}.
pt_pt: Os ficheiros do DeltaTalk foram copiados/actualizados com sucesso para {path}.

source: Some files may not have been copied. Synthesizer functionality may be limited.
pt_br: Alguns arquivos podem não ter sido copiados. A funcionalidade do sintetizador pode ser limitada.
pt_pt: Alguns ficheiros podem não ter sido copiados. A funcionalidade do sintetizador pode ser limitada.

source: DLL not found in: {path}
pt_br: DLL não encontrada em: {path}
pt_pt: DLL não encontrada em: {path}

source: DeltaTalk DLL not found. Check the installation of the add-on.
pt_br: DLL do DeltaTalk não encontrada. Verifique a instalação do complemento.
pt_pt: A DLL do DeltaTalk não foi encontrada. Verifique a instalação do extra.

source: DLL loaded successfully
pt_br: DLL carregada com sucesso
pt_pt: DLL carregada com sucesso

source: Error loading DeltaTalk DLL in {path}: {error}
pt_br: Erro ao carregar a DLL do DeltaTalk em {path}: {error}
pt_pt: Erro ao carregar a DLL do DeltaTalk em {path}: {error}

source: Failed to load DLL Dtalk32T.dll: {error}
pt_br: Falha ao carregar a DLL Dtalk32T.dll: {error}
pt_pt: Falha ao carregar a DLL Dtalk32T.dll: {error}

source: DeltaTalk synthesizer failed to initialize
pt_br: Falha ao inicializar o sintetizador DeltaTalk
pt_pt: Falha na inicialização do sintetizador DeltaTalk

source: Error managing symbol dictionary: {error}
pt_br: Erro ao gerenciar o dicionário de símbolos: {error}
pt_pt: Erro na gestão do dicionário de símbolos: {error}

source: Error calculating hash for {file}: {error}
pt_br: Erro ao calcular o hash para {file}: {error}
pt_pt: Erro ao calcular o hash para {file}: {error}

source: Attempt to initialize TTS without the DLL loaded.
pt_br: Tentativa de inicializar o TTS sem a DLL carregada.
pt_pt: Tentativa de inicialização do TTS sem a DLL carregada.

source: NVDA directory: {path}
pt_br: Diretório do NVDA: {path}
pt_pt: Diretório do NVDA: {path}

source: Files in the folder: {files}
pt_br: Arquivos na pasta: {files}
pt_pt: Ficheiros na pasta: {files}

source: Original work directory: {path}
pt_br: Diretório de trabalho original: {path}
pt_pt: Diretório de trabalho original: {path}

source: Work directory changed to: {path}
pt_br: Diretório de trabalho alterado para: {path}
pt_pt: Diretório de trabalho alterado para: {path}

source: Starting TTS initialization
pt_br: Iniciando inicialização do TTS
pt_pt: A iniciar a inicialização do TTS

source: Error initializing TTS: {error}
pt_br: Erro ao inicializar o TTS: {error}
pt_pt: Erro ao inicializar o TTS: {error}

source: Unknown error
pt_br: Erro desconhecido
pt_pt: Erro desconhecido

source: DeltaTalk initialized. Instance: {instance}
pt_br: DeltaTalk inicializado. Instância: {instance}
pt_pt: DeltaTalk inicializado. Instância: {instance}

source: Work directory restored
pt_br: Diretório de trabalho restaurado
pt_pt: Diretório de trabalho restaurado

source: DeltaTalk symbol dictionary automatically activated
pt_br: Dicionário de símbolos do Deltatalk ativado automaticamente
pt_pt: Dicionário de símbolos do DeltaTalk ativado automaticamente

source: DeltaTalk symbol dictionary already active
pt_br: O dicionário de símbolos do DeltaTalk já está ativo
pt_pt: O dicionário de símbolos do DeltaTalk já está ativo

source: nvwave configured: {rate}Hz, {channels} channels, {bits} bits, device: {device}
pt_br: nvwave configurado: {rate}Hz, {channels} canais, {bits} bits, dispositivo: {device}
pt_pt: nvwave configurado: {rate}Hz, {channels} canais, {bits} bits, dispositivo: {device}

source: Error configuring nvwave: {error}
pt_br: Erro ao configurar nvwave: {error}
pt_pt: Erro ao configurar o nvwave: {error}

source: Audio thread started
pt_br: Thread de áudio iniciada
pt_pt: Thread de áudio iniciada

source: Processing text in audio worker: {text}, index: {index}
pt_br: Processando texto no gerenciador da fila de áudio: {text}, índice: {index}
pt_pt: A processar texto no gestor da fila de áudio: {text}, índice: {index}

source: Error in audio worker: {error}
pt_br: Erro no gerenciador da fila de áudio: {error}
pt_pt: Erro no gestor da fila de áudio: {error}

source: Falling back to direct playback due to missing instance or nvwave player
pt_br: Retornando à reprodução direta devido à falta de instância ou reprodutor nvwave
pt_pt: A regressar à reprodução direta devido à falta de uma instância ou do leitor nvwave

source: Waiting for previous synthesis to complete
pt_br: Aguardando a conclusão da síntese anterior
pt_pt: A aguardar a conclusão da síntese anterior

source: Synthesis timeout, falling back to direct playback
pt_br: Tempo de síntese esgotado, voltando para a reprodução direta
pt_pt: Tempo limite excedido para a síntese, a regressar à reprodução direta

source: Attempting to generate audio for text: {text}, index: {index}
pt_br: Tentando gerar áudio para texto: {text}, índice: {index}
pt_pt: A tentar gerar áudio para texto: {text}, índice: {index}

source: Starting multi-block audio generation, text length: {length}
pt_br: Iniciando a geração de áudio multi-blocos, comprimento do texto: {length}
pt_pt: A iniciar a geração de áudio multi-bloco, comprimento do texto: {length}

source: Calling TTSENG_GenAudioBuffer with NEW_MULTI_BLOCK, buffer size: {size}
pt_br: Chamando TTSENG_GenAudioBuffer com NEW_MULTI_BLOCK, tamanho do buffer: {size}
pt_pt: Chamada de TTSENG_GenAudioBuffer com NEW_MULTI_BLOCK, tamanho da memória intermédia: {size}

source: TTSENG_GenAudioBuffer (NEW_MULTI_BLOCK) returned: {result}, bytes written: {bytes}
pt_br: TTSENG_GenAudioBuffer (NEW_MULTI_BLOCK) retornou: {result}, bytes escritos: {bytes}
pt_pt: O TTSENG_GenAudioBuffer (NEW_MULTI_BLOCK) devolveu: {result}, bytes escritos: {bytes}

source: Error starting multi-block audio: {error} ({code})
pt_br: Erro ao iniciar áudio multi-blocos: {error} ({code})
pt_pt: Erro ao iniciar áudio multi-bloco: {error} ({code})

source: Feeding initial audio data to nvwave: {bytes} bytes
pt_br: Transmitindo os dados de áudio iniciais para nvwave: {bytes} bytes
pt_pt: Envio dos dados de áudio iniciais para o nvwave: {bytes} bytes

source: Calling TTSENG_GenAudioBuffer with NEXT_BLOCK, buffer size: {size}
pt_br: Chamando TTSENG_GenAudioBuffer com NEXT_BLOCK, tamanho do buffer: {size}
pt_pt: Chamada de TTSENG_GenAudioBuffer com NEXT_BLOCK, tamanho da memória intermédia: {size}

source: TTSENG_GenAudioBuffer (NEXT_BLOCK) returned: {result}, bytes written: {bytes}
pt_br: TTSENG_GenAudioBuffer (NEXT_BLOCK) retornou: {result}, bytes escritos: {bytes}
pt_pt: O TTSENG_GenAudioBuffer (NEXT_BLOCK) devolveu: {result}, bytes escritos: {bytes}

source: Error processing multi-block audio: {error} ({code})
pt_br: Erro ao processar áudio multi-blocos: {error} ({code})
pt_pt: Erro no processamento do áudio em multi-bloco: {error} ({code})

source: Feeding audio data to nvwave: {bytes} bytes
pt_br: Transmitindo dados de áudio para nvwave: {bytes} bytes
pt_pt: Envio dos dados de áudio para o nvwave: {bytes} bytes

source: Audio successfully fed to nvwave for text: {text}
pt_br: Áudio transmitido com sucesso ao nvwave para texto: {text}
pt_pt: Áudio enviado com sucesso para o nvwave para texto: {text}

source: Exception in audio generation: {error}
pt_br: Exceção na geração de áudio: {error}
pt_pt: Exceção na geração de áudio: {error}

source: Waiting for previous direct playback to complete
pt_br: Aguardando a reprodução direta anterior ser concluída
pt_pt: A aguardar a conclusão da reprodução direta anterior

source: Direct playback timeout, skipping
pt_br: Tempo de reprodução direta esgotado, ignorando
pt_pt: Tempo limite excedido para a reprodução direta, saltar

source: Using direct playback for text: {text}
pt_br: Usando reprodução direta para o texto: {text}
pt_pt: A utilizar a reprodução direta para texto: {text}

source: Error when attaching text: {error}
pt_br: Erro ao anexar texto: {error}
pt_pt: Erro ao anexar texto: {error}

source: Attached text: {text}
pt_br: Texto anexado: {text}
pt_pt: Texto anexado: {text}

source: Error when speaking text: {error}
pt_br: Erro ao falar texto: {error}
pt_pt: Erro ao falar texto: {error}

source: Spoken text: {text}
pt_br: Texto falado: {text}
pt_pt: Texto falado: {text}

source: Error when processing text: {error}
pt_br: Erro ao processar texto: {error}
pt_pt: Erro no processamento do texto: {error}

source: Text queued for nvwave: {text}, index: {index}
pt_br: Texto na fila para nvwave: {text}, índice: {index}
pt_pt: Texto em fila de espera para o nvwave: {text}, índice: {index}

source: Audio queue full, using direct playback
pt_br: Fila de áudio cheia, usando reprodução direta
pt_pt: Fila de áudio cheia, a utilizar a reprodução direta

source: Using direct playback due to nvwave not available
pt_br: Usando reprodução direta devido ao nvwave não estar disponível
pt_pt: A utilizar a reprodução direta devido ao nvwave não estar disponível

source: Speech attempt without initialized instance.
pt_br: Tentativa de fala sem instância inicializada.
pt_pt: Tentativa de discurso sem instância inicializada.

source: Error when applying settings: {error} ({code})
pt_br: Erro ao aplicar configurações: {error} ({code})
pt_pt: Erro ao aplicar as definições: {error} ({code})

source: Settings applied: rate={rate}, volume={volume}, pitch={pitch}
pt_br: Configurações aplicadas: velocidade={rate}, volume={volume}, tom={pitch}
pt_pt: Definições aplicadas: velocidade={rate}, volume={volume}, entoação={pitch}

source: Error when applying voice: {error} ({code})
pt_br: Erro ao aplicar voz: {error} ({code})
pt_pt: Erro ao aplicar a voz: {error} ({code})

source: Applied voice: {voice} (ID: {id})
pt_br: Voz aplicada: {voice} (ID: {id})
pt_pt: Voz aplicada: {voice} (ID: {id})

source: Speed set to {rate} (converted from {original})
pt_br: Velocidade configurada para {rate} (convertido de {original})
pt_pt: Velocidade definida para {rate} (convertida de {original})

source: Pitch set to {pitch} (converted from {original})
pt_br: Tom configurado para {pitch} (convertido de {original})
pt_pt: Entoação definida para {pitch} (convertida de {original})

source: Volume set to {volume} (converted from {original})
pt_br: Volume configurado para {volume} (convertido de {original})
pt_pt: Volume definido para {volume} (convertido de {original})

source: Error configuring voice: {error} ({code})
pt_br: Erro ao configurar voz: {error} ({code})
pt_pt: Erro ao configurar a voz: {error} ({code})

source: Voice changed to {voice}
pt_br: Voz alterada para {voice}
pt_pt: A voz mudou para {voice}

source: Reconfiguring nvwave for new sample rate: {rate}Hz
pt_br: Reconfigurando o nvwave para nova taxa de amostragem: {rate}Hz
pt_pt: A reconfigurar o nvwave para a nova taxa de amostragem: {rate}Hz

source: Text paused
pt_br: Texto pausado
pt_pt: Texto pausado

source: Text resumed
pt_br: Texto retomado
pt_pt: Texto retomado

source: nvwave paused
pt_br: nvwave pausado
pt_pt: nvwave em pausa

source: nvwave resumed
pt_br: nvwave retomado
pt_pt: nvwave retomado

source: Error pausing/resuming nvwave: {error}
pt_br: Erro ao pausar/retomar nvwave: {error}
pt_pt: Erro ao pausar/retomar o nvwave: {error}

source: Text stopped
pt_br: Texto parado
pt_pt: Texto parado

source: nvwave stopped
pt_br: nvwave parado
pt_pt: nvwave parado

source: Error stopping nvwave: {error}
pt_br: Erro ao parar o nvwave: {error}
pt_pt: Erro ao parar o nvwave: {error}

source: Audio thread did not terminate gracefully
pt_br: A thread de áudio não terminou de forma adequada
pt_pt: A thread de áudio não terminou de forma graciosa

source: nvwave player closed
pt_br: reprodutor nvwave fechado
pt_pt: leitor nvwave fechado

source: Error closing nvwave player: {error}
pt_br: Erro ao fechar o reprodutor nvwave: {error}
pt_pt: Erro ao fechar o leitor nvwave: {error}

source: Error when closing: {error} ({code})
pt_br: Erro ao fechar: {error} ({code})
pt_pt: Erro ao fechar: {error} ({code})

source: DeltaTalk synthesizer successfully closed
pt_br: Sintetizador DeltaTalk encerrado com sucesso
pt_pt: Sintetizador DeltaTalk fechado com sucesso

source: Error closing the synthesizer: {error}
pt_br: Erro ao fechar o sintetizador: {error}
pt_pt: Erro ao fechar o sintetizador: {error}

source: MicroPower DeltaTalk TTS (Initial Prototipe)
pt_br: MicroPower DeltaTalk TTS (protótipo inicial)
pt_pt: MicroPower DeltaTalk TTS (protótipo inicial)

source: DeltaTalk is the first high-quality speech synthesizer available for the Portuguese language. This add-on implements NVDA compatibility with this synthesizer.
pt_br: DeltaTalk é o primeiro sintetizador de voz de alta qualidade, disponível para a língua portuguesa. Este complemento implementa a compatibilidade do NVDA com este sintetizador.
pt_pt: O DeltaTalk é o primeiro sintetizador de fala de alta qualidade, disponível para a língua portuguesa. Este extra implementa a compatibilidade do NVDA com este sintetizador.

source: DeltaTalk Symbol Dictionary
pt_br: Dicionário de Símbolos do DeltaTalk
pt_pt: Dicionário de símbolos do DeltaTalk

source: Batch file executed successfully
pt_br: Arquivo em lote executado com sucesso
pt_pt: Ficheiro batch executado com sucesso

source: Copying {source} to {target}
pt_br: Copiando {source} para {target}
pt_pt: A copiar {source} para {target}

source: Successfully copied {count} files
pt_br: {count} arquivos copiados com sucesso
pt_pt: Foram copiados {count} ficheiros com sucesso

source: Error during elevated copy operation: {error}
pt_br: Erro durante a operação de cópia elevada: {error}
pt_pt: Erro durante a operação de cópia elevada: {error}

source: Successfully copied {count} files without elevation
pt_br: {count} arquivos copiados com sucesso sem elevação
pt_pt: Foram copiados {count} ficheiros com sucesso sem elevação

source: Error during normal copy operation: {error}
pt_br: Erro durante a operação de cópia normal: {error}
pt_pt: Erro durante a operação normal de cópia: {error}

source: DeltaTalk installation started
pt_br: Instalação do DeltaTalk iniciada
pt_pt: Instalação do DeltaTalk iniciada

source: Source path: {path}
pt_br: Caminho de origem: {path}
pt_pt: Caminho de origem: {path}

source: Target path: {path}
pt_br: Caminho de destino: {path}
pt_pt: Caminho de destino: {path}

source: Source directory not found: {path}
pt_br: Diretório de origem não encontrado: {path}
pt_pt: Diretório de origem não encontrado: {path}

source: Installation Error
pt_br: Erro de instalação
pt_pt: Erro de instalação

source: Dictionary file {file} missing in target. Will be copied.
pt_br: Arquivo de dicionário {file} ausente no destino. Será copiado.
pt_pt: Ficheiro de dicionário {file} em falta no destino. Será copiado.

source: Dictionary file {file} has changed. Will be copied.
pt_br: O arquivo de dicionário {file} foi alterado. Será copiado.
pt_pt: O ficheiro de dicionário {file} foi alterado. Será copiado.

source: Source file not found in add-on: {file}. Skipping.
pt_br: Arquivo de origem não encontrado no complemento: {file}. Ignorado.
pt_pt: Ficheiro fonte não encontrado no extra: {file}. Saltar.

source: File missing in target: {file}. Will be copied.
pt_br: Arquivo ausente no destino: {file}. Será copiado.
pt_pt: Ficheiro em falta no destino: {file}. Será copiado.

source: No files need to be copied to {path}
pt_br: Nenhum arquivo precisa ser copiado para {path}
pt_pt: Não é necessário copiar quaisquer ficheiros para {path}

source: All DeltaTalk files, including the pronunciation dictionary ({dict}), are already present and up to date in the NVDA program directory ({path}). Installation will proceed without copying new files.
pt_br: Todos os arquivos do DeltaTalk, incluindo o dicionário de pronúncia ({dict}), já estão presentes e atualizados no diretório do programa NVDA ({path}). A instalação continuará sem copiar novos arquivos.
pt_pt: Todos os ficheiros do DeltaTalk, incluindo o dicionário de pronúncia ({dict}), já estão presentes e atualizados no diretório do programa NVDA ({path}). A instalação prosseguirá sem copiar novos ficheiros.

source: Installation Information
pt_br: Informações de Instalação
pt_pt: Informação de instalação

source: Elevation needed: {status}
pt_br: Elevação necessária: {status}
pt_pt: Elevação necessária: {status}
